---
kind: other
id: Methods.T:Autodesk.Revit.DB.TextNode
source: html/2b345015-4289-ba6f-f7d8-19b66eae4ead.htm
---
# TextNode Methods

Returns an FormattedText object that contains text and associated formatting of this TextNode.